КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул4/КонтурЛогистика_ТрН_Титул4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул4</name>
  <posting>Deny</posting>
  <attributes>
    <name>ЭтоПриемВозврата</name>
    <comment>реквизит в Т3 и Т4 позволяющий понять что началась цепочка после первичной приемки и оформления Т7 на возврат</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <comment>Может отличаться от Гп в ТРН т.к. могла быть сделана переадресовка</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительСтрока</name>
    <comment>kl-driver из customData</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПрвВыд</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПрвВыд</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфГП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфГП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфГП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспрГП</name>
    <comment>Номер исправления титула 3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспрГП</name>
    <comment>Дата исправления титула 3</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПГП</name>
    <comment>Электронная подпись файла обмена информации грузополучателя о приеме груза</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтметкиПеревозчика</name>
    <comment>есть ли в титуле элемент ОтметПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЗамечанияПеревозчика</name>
    <comment>есть ли в титуле элемент ЗамПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПриб</name>
    <comment>МСК</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрУбыт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПосВыгр</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамСостГруз</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамРабВыгр</name>
    <comment>Оговорки и замечания в отношении проведения работ по выгрузке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринятьЧастично</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтказВПриемке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиПеревозчика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтмАктВзв</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамечанияИнфПол</name>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул4/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		// TODO
		//ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		//ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	НайденныйТ3 = НайтиТ3сУчетомВозвратнойЦепочки();
	ЗаполнитьПризнакиПриемкиПоТитулу3(НайденныйТ3);
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул4_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Функция НайтиТ3сУчетомВозвратнойЦепочки()
	
	НайденныйТ3 = НайтиТ3ПоИдФайлИнфГП();
	Если ЗначениеЗаполнено(НайденныйТ3) Тогда
		Возврат НайденныйТ3;
	КонецЕсли;
	
	Если ЭтоПриемВозврата Тогда
		НайденныйТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Возвратную(ДокументЭТРН);
	Иначе
		НайденныйТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Основную(ДокументЭТРН);
	КонецЕсли;
	
	Возврат НайденныйТ3;
	
КонецФункции

// Возвращает Т3 по указателю ИдФайлИнфГП (имя файла обмена предыдущего титула).
//
Функция НайтиТ3ПоИдФайлИнфГП()
	
	Если Не ЗначениеЗаполнено(ИдФайлИнфГП) Тогда
		Возврат Документы.КонтурЛогистика_ТрН_Титул3.ПустаяСсылка();
	КонецЕсли;
	
	ИменаФайлов = Новый Массив;
	ИменаФайлов.Добавить(ИдФайлИнфГП);
	Если Найти(ИдФайлИнфГП, ".xml") = 0 Тогда
		ИменаФайлов.Добавить(ИдФайлИнфГП + ".xml");
	КонецЕсли;
	
	Для Каждого ИмяФайла Из ИменаФайлов Цикл
		
		ФайлОбмена = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиФайлОбменаПоИмениФайла(ИмяФайла);
		Если Не ЗначениеЗаполнено(ФайлОбмена) Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыФайла = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(
			ФайлОбмена, "СвязанныйДокумент");
		СвязанныйДокумент = РеквизитыФайла.СвязанныйДокумент;
		
		Если ТипЗнч(СвязанныйДокумент) <> Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
			Или Не ЗначениеЗаполнено(СвязанныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументЭТРН) Тогда
			ДокументЭТРНТитула = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(
				СвязанныйДокумент, "ДокументЭТРН").ДокументЭТРН;
			Если ДокументЭТРНТитула <> ДокументЭТРН Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Возврат СвязанныйДокумент;
		
	КонецЦикла;
	
	Возврат Документы.КонтурЛогистика_ТрН_Титул3.ПустаяСсылка();
	
КонецФункции

Процедура ЗаполнитьПризнакиПриемкиПоТитулу3(Знач НайденныйТ3)
	
	Если Не ЗначениеЗаполнено(НайденныйТ3) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыТ3 = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(
		НайденныйТ3, "ЭтоПриемВозврата, ПринятьЧастично, ОтказВПриемке");
	
	ЭтоПриемВозврата = РеквизитыТ3.ЭтоПриемВозврата;
	ПринятьЧастично  = РеквизитыТ3.ПринятьЧастично;
	ОтказВПриемке    = РеквизитыТ3.ОтказВПриемке;
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		ЗаполнитьПризнакиПриемкиПоТитулу3(НайтиТ3ПоИдФайлИнфГП());
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	СодПрвВыд 		= КС.XDTO_Вычислить(XDTO, "Документ.СодПрвВыд");
	ОтметПрв 		= КС.XDTO_Вычислить(СодПрвВыд, "ОтметПрвВыд");
	
	ДатИнфПрвВыд 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфПрвВыд"));
	ВрИнфПрвВыд 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфПрвВыд"));
	
	ДатФайлИнфГП 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГП.ДатФайлИнфГП"));
	ВрФайлИнфГП 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГП.ВрФайлИнфГП"));
	ИдФайлИнфГП 	= КС.XDTO_Вычислить(Документ, "ИдИнфГП.ИдФайлИнфГП");
	
	Если ЗначениеЗаполнено(ИдФайлИнфГП) Тогда
		НомерДатаИсправления = КонтурЛогистика_ОбработкаДокументовСервер.НомерДатаИсправленияПоИмениФайла(ИдФайлИнфГП);
		НомИспрГП = НомерДатаИсправления.НомИспр;
		ДатаИспрГП = НомерДатаИсправления.ДатаИспр;
	КонецЕсли;
	
	ЭПГП = КС.XDTO_Вычислить(Документ, "ИдИнфГП.ЭП");
	
	СтатПодп_raw = КС.XDTO_Вычислить(Документ, "Подписант.СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
	
	Должность = КС.XDTO_Вычислить(Документ, "Подписант.Должн");
	Фамилия = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Фамилия");
	Имя = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Имя");
	Отчество = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Отчество");
	
	ЕстьЗамечанияПеревозчика = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьЗамечанияПеревозчикаXDTO(СодПрвВыд, Ложь);
	ЕстьОтметкиПеревозчика	 = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьОтметкиПеревозчикаXDTO(ОтметПрв);
	
	Если ЕстьЗамечанияПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьЗамечанияПеревозчикаXDTO(СодПрвВыд, ЭтотОбъект, Ложь);
	КонецЕсли;
	
	Если ЕстьОтметкиПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьОтметкиПеревозчикаXDTO(ОтметПрв, ЭтотОбъект);
	КонецЕсли;
		
	КонтурЛогистика_КонструкторыXDTO.ЗаполнитьИнфПолИзXDTO(СодПрвВыд, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ДанныеЗаполнения.Свойство("СпецСценарий") Тогда
		СпецСценарий = ДанныеЗаполнения.СпецСценарий;
	Иначе
		СпецСценарий = Неопределено;
	КонецЕсли;
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляСледующегоТитула(ПредыдущийТитул, СпецСценарий);
	
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда
		ДокументОснование = НайденныйДокУчСист;
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ДанныеЗаполнения.ТипЛогистика,, СпецСценарий);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	ОтметкиПеревозчика.Очистить();
	Акты.Очистить();
	Штрафы.Очистить();
	ИнфПол.Очистить();
	ЗамечанияИнфПол.Очистить();
	ОтметкиИнфПол.Очистить();
	
	ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул, Знач ВходящийФайлТитула3 = Неопределено) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула3;
	
	Если ВходящийФайлТитула3 = Неопределено Тогда
		ФайлТитула3 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
	Иначе
		ФайлТитула3 = ВходящийФайлТитула3;
	КонецЕсли;
	
	ИдФайлИнфГП 	= СтрЗаменить(ФайлТитула3.ИмяФайла, ".xml", "");
	ДатФайлИнфГП 	= ПредыдущийТитул.ДатИнфГП;
	ВрФайлИнфГП  	= ПредыдущийТитул.ВрИнфГП;
	НомИспрГП	  	= ПредыдущийТитул.НомИспр;
	ДатаИспрГП  	= ПредыдущийТитул.ДатаИспр;
	ДвоичныеДанныеПодписи = ФайлТитула3.Подпись.Получить();
	ЭПГП 				= Base64Строка(ДвоичныеДанныеПодписи);

	ПринятьЧастично 				= ПредыдущийТитул.ПринятьЧастично;
	ОтказВПриемке 					= ПредыдущийТитул.ОтказВПриемке;
	ЭтоПриемВозврата 				= ПредыдущийТитул.ЭтоПриемВозврата;
	Грузополучатель 				= ПредыдущийТитул.Грузополучатель;
	ГрузополучательПодразделение 	= ПредыдущийТитул.ГрузополучательПодразделение;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт 
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации)
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул4.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфПрвВыд = ТекущаяДатаСеанса();
		ВрИнфПрвВыд = ТекущаяДатаСеанса();
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфПрвВыд, ВрИнфПрвВыд);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвВыд и ВрИнфПрвВыд
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 4;
	Формат = "5.01";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	ДополнительныеПолучателиФайлаОбмена = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДопПолучателейФайла(ДокументЭТРН);
	
	Если ДополнительныеПолучателиФайлаОбмена.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайлаОбмена); 	
	
	Если ЗначениеЗаполнено(Грузополучатель) Тогда 
		текГП = Грузополучатель;
	Иначе
		текГП = ДокументЭТРН.Грузополучатель;
	КонецЕсли;
	
	Если ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ИстинныйГрузоотправитель,
												ДокументЭТРН.Перевозчик,
												текГП,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура);
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
	
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодПрвВыд = КС.XDTO_СодПрвВыд(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодПрвВыд", XDTO_СодПрвВыд);
	
	XDTO_ИдИнфГП 		= КС.XDTO_ИдИнфГП(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфГП", XDTO_ИдИнфГП);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		НайденныйТ3 = НайтиТ3сУчетомВозвратнойЦепочки();
		ЗаполнитьПризнакиПриемкиПоТитулу3(НайденныйТ3);
		
		Если НомИспрГП <> 0 Тогда
			// Пометим на удаление предыдущий титул
			ФалыйДляУдаления = Новый Массив;
			
			Титулы4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитулыГлавногоПоТипу(
				Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4, ДокументЭТРН);
			Для Каждого ТекущийТитул Из Титулы4 Цикл
				ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ТекущийТитул);
				
				Если ЗначениеЗаполнено(ФайлТитула) Тогда
					ФалыйДляУдаления.Добавить(ФайлТитула);
				КонецЕсли;
			КонецЦикла;
			
			КонтурЛогистика_ОбработкаДокументовСервер.УдалитьФайлыИСвязныеОбъекты(ФалыйДляУдаления);
		КонецЕсли;
		
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул4_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

#КонецЕсли
